cf/InformationRegisters/АктивныеСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АктивныеСпецификации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииДоговоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСпецификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСпецификаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕстьАктивнаяСпецификация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ЛогистическиеСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЛогистическиеСпецификации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛогистическаяСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛогистическиеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ВариантДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СамовывозСНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоГрузоперевозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоКлиентаНашимиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамовывозСоСкладаПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамовывозСТерминала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоСкладаТК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоСкладаПоставщиком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВорд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыWord</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пролонгация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПролонгацияДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыРасчетовПоДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПретензионныйПорядок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПретензионныйПорядок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсудность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подсудность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьБезЗащиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УровниСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПролонгируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/РаботаСКонтрагентами/Ext/Module.bsl
Процедура ЗаполнитьСписокВариантовДоставкиДляПокупки(СписокВариантовДоставки) Экспорт
	
	СписокВариантовДоставки.Очистить();
	СписокВариантовДоставки.Добавить(Перечисления.ВариантДоставки.ДоставкаСоСкладаПоставщиком, Строка(Перечисления.ВариантДоставки.ДоставкаСоСкладаПоставщиком));
	СписокВариантовДоставки.Добавить(Перечисления.ВариантДоставки.ДоставкаСоСкладаТК, Строка(Перечисления.ВариантДоставки.ДоставкаСоСкладаТК));
	СписокВариантовДоставки.Добавить(Перечисления.ВариантДоставки.СамовывозСоСкладаПоставщика, Строка(Перечисления.ВариантДоставки.СамовывозСоСкладаПоставщика));
	//СписокВариантовДоставки.Добавить(Перечисления.ВариантДоставки.СамовывозСТерминала, Строка(Перечисления.ВариантДоставки.СамовывозСТерминала));
	
КонецПроцедуры

Процедура ЗаполнитьСписокВариантовДоставкиДляПродажки(СписокВариантовДоставки) Экспорт
	
	СписокВариантовДоставки.Очистить();
	СписокВариантовДоставки.Добавить(Перечисления.ВариантДоставки.ДоставкаДоГрузоперевозчика, Строка(Перечисления.ВариантДоставки.ДоставкаДоГрузоперевозчика));
	СписокВариантовДоставки.Добавить(Перечисления.ВариантДоставки.ДоставкаДоКлиента, Строка(Перечисления.ВариантДоставки.ДоставкаДоКлиента));
	СписокВариантовДоставки.Добавить(Перечисления.ВариантДоставки.ДоставкаДоКлиентаНашимиСилами, Строка(Перечисления.ВариантДоставки.ДоставкаДоКлиентаНашимиСилами));
	СписокВариантовДоставки.Добавить(Перечисления.ВариантДоставки.СамовывозСНашегоСклада, Строка(Перечисления.ВариантДоставки.СамовывозСНашегоСклада));
	
КонецПроцедуры

Процедура ЗаписьСтатусаСпецификацииПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не Источник.ДополнительныеСвойства.ЭтоНовый 
			И Не Источник.ДополнительныеСвойства.Свойство("ЗаписатьСтатус")
			И Не Источник.ДополнительныеСвойства.Свойство("СменаСтатуса") Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураСтатуса = Новый Структура("Поставщик,Договор,ЕстьАктивнаяСпецификация,Спецификация,СтатусСпецификации",
										Источник.Поставщик, 
										Источник.Договор,
										Источник.СтатусСпецификации = Перечисления.СтатусыСпецификаций.Активна
											Или Источник.ДополнительныеСвойства.Свойство("СделатьНеАктивной"),
										Источник.Ссылка,
										Источник.СтатусСпецификации);
										
	МенеджерЗаписи = РегистрыСведений.АктивныеСпецификации.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураСтатуса);
															
	Если Источник.ДополнительныеСвойства.Свойство("СделатьНеАктивной") Тогда 
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ЕстьАктивнаяСпецификация = Ложь;
	Иначе 
		МенеджерЗаписи.ЕстьАктивнаяСпецификация = СтруктураСтатуса.ЕстьАктивнаяСпецификация;
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи.Записать(Не СтруктураСтатуса.ЕстьАктивнаяСпецификация Или Источник.ДополнительныеСвойства.Свойство("СделатьНеАктивной"));
	Исключение
		Отказ = Истина;
		Сообщить("Для поставщика "  
					+ Строка(Источник.Поставщик) + 
					" по договору " + 
					Строка(Источник.Договор)
					+ " уже есть активная спецификация");
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьСтатусСпецификации(Спецификация, СтатусСпецификации) Экспорт 
	
	Если Спецификация.СтатусСпецификации = СтатусСпецификации Тогда 
		Возврат;
	КонецЕсли;
	
	СпецификацияОбъект = Спецификация.ПолучитьОбъект();
	СпецификацияОбъект.СтатусСпецификации = СтатусСпецификации;
	СпецификацияОбъект.Записать();
	
КонецПроцедуры

Процедура ПролонгацияДоговоров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорПролонгировать,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Пролонгация.КоличествоМесяцевПролонгации, 0) КАК КоличествоМесяцевПролонгации
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ДатаОкончания <= &ТекущаяДата
	|	И ДоговорыКонтрагентов.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДоговорыКонтрагентов.ДоговорПролонгируется";
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ДоговорОбъект = Выборка.ДоговорПролонгировать.ПолучитьОбъект();
		ДоговорОбъект.ДатаОкончания = ДобавитьМесяц(ДоговорОбъект.ДатаОкончания, Выборка.КоличествоМесяцевПролонгации);
		ДоговорОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписьЛогистическойСпецификацииПриЗаписи(Источник, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛогистическиеСпецификации.Поставщик,
	|	ЛогистическиеСпецификации.СпособДоставки
	|ИЗ
	|	РегистрСведений.ЛогистическиеСпецификации КАК ЛогистическиеСпецификации
	|ГДЕ
	|	ЛогистическиеСпецификации.ЛогистическаяСпецификация = &ЛогистическаяСпецификация";
	
	Запрос.УстановитьПараметр("ЛогистическаяСпецификация", Источник.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НаборЗаписей = РегистрыСведений.ЛогистическиеСпецификации.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Поставщик.Установить(Выборка.Поставщик);
		НаборЗаписей.Отбор.СпособДоставки.Установить(Выборка.СпособДоставки);
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	Если Источник.ПометкаУдаления Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЛогистическиеСпецификации.СоздатьНаборЗаписей();
	
	Для Каждого ТекСтрока Из Источник.Состав Цикл 
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Поставщик = ТекСтрока.Поставщик;
		НоваяЗапись.СпособДоставки = ТекСтрока.СпособДоставки;
		НоваяЗапись.ЛогистическаяСпецификация = Источник.Ссылка;
	КонецЦикла;
	
	Попытка 
		НаборЗаписей.Записать(Ложь);
	Исключение
		Сообщить("Проверьте уникальность поставщика и способа доставки!");
	КонецПопытки;
	
КонецПроцедуры
